<a href="https://colab.research.google.com/github/andreadavi/ciencia_de_dados/blob/main/Introdu%C3%A7%C3%A3o_Ciencia_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# bibliotecas
import numpy as np # para fazer algebra linear , computacao cientifica
import pandas as pd # framework para analise de dados, biblioteca
import seaborn as sns # visualizacao dos dados, gráficos
import matplotlib.pyplot as plt # bibliotecas para visualização, gráficos

#Conhecendo o Dataset

In [4]:
#pandas lê em vários tipos de arquivos, csv, excel, html, sql, query sql etc

df = pd.read_csv('train.csv', index_col='id')  #objeto dataframe guarda os dados de maneira organizada
# transformo o id no index gerado pelo panda index_col='nome da coluna sem dados repetidos'

In [5]:
df.head() #mostra o que tem dentro do dataframe, das 5 primeiras linhas "head"
# df.head(10) mostra as 10 primeiras entradas
#geralmente queremos ver apenas alguns para entender os dados
# df.tail() #mostra os últimos 5

    age          job   marital  ... euribor3m nr.employed   y
id                              ...
0    52   technician  divorced  ...     4.865      5228.1  no
1    36   management   married  ...     4.153      5195.8  no
2    53  blue-collar   married  ...     4.962      5228.1  no
3    45  blue-collar    single  ...     0.879      5076.2  no
4    60    housemaid   married  ...     4.858      5191.0  no

[5 rows x 21 columns]

In [6]:
df.info() #fornece algumas informações mais concentradas para humanos entenderem
# quantas colunas, qtos valores nao nulos tem, contagem de nao nulos de acordo com colunas
# object = dados de texto, int e float tbm são os tipos
# y é a variavel que tentarei prever no futuro
# o tamanho do arquivo

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37069 entries, 0 to 37068
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             37069 non-null  int64
 1   job             36773 non-null  object
 2   marital         37000 non-null  object
 3   education       35505 non-null  object
 4   default         29296 non-null  object
 5   housing         36176 non-null  object
 6   loan            36176 non-null  object
 7   contact         37069 non-null  object
 8   month           37069 non-null  object
 9   day_of_week     37069 non-null  object
 10  duration        37069 non-null  int64
 11  campaign        37069 non-null  int64
 12  pdays           37069 non-null  int64
 13  previous        37069 non-null  int64
 14  poutcome        37069 non-null  object
 15  emp.var.rate    37069 non-null  float64
 16  cons.price.idx  37069 non-null  float64
 17  cons.conf.idx   37069 non-null  float64
 18  euribor3m       37069 non-null  float64
 19  nr.employed     37069 non-null  float64
 20  y               37069 non-null  object
dtypes: float64(5), int64(5), object(11)
memory usage: 6.2+ MB

In [7]:
df.describe()
# consigo visualizar como variam as variaveis numericas (média, desvio padrao, mínimo, maximo)
# repito, não exibe variaveis não numericas!
# ex. menor idade, média da idade, maior idade, desvio padrao da idade
# 25%, 50%, 75% - primeiro quartil, mediana, 3/4 - quartis
# 999 não faz sentido para média, mas para saber que foi uma pessoa que nunca teve contato - é uma estratégia 
#           análise estatística       para ver por último essas pessoas

                age      duration  ...     euribor3m   nr.employed
count  37069.000000  37069.000000  ...  37069.000000  37069.000000
mean      40.023497    258.185492  ...      3.620484   5166.966047
std       10.412653    259.579105  ...      1.735310     72.360902
min       17.000000      0.000000  ...      0.634000   4963.600000
25%       32.000000    103.000000  ...      1.344000   5099.100000
50%       38.000000    180.000000  ...      4.857000   5191.000000
75%       47.000000    319.000000  ...      4.961000   5228.100000
max       98.000000   4918.000000  ...      5.045000   5228.100000

[8 rows x 10 columns]

In [8]:
df.describe(include='object')
# consigo visualizar os valores não numéricos - descrição diferente dos numéricos
# tipos de dados diferentes precisam de análises de dados diferentes
# é preciso intimidade com os dados para saber o que é mais relevante
# / variaveis categóricas = tipo de variavel em que tenho categorias, são textos
# \ variáveis numéricas 
# unique = quantas categorias tenho para cada coluna
#     exemplo: se tem dívida - tenho apenas 2 categorias (sim ou não)
#              dias da semana - 5 diferentes, meses: 10 diferentes
#              y que é a categoria que estamos interessados (sim ou não)
# top = qual é a categoria mais frequente, o trabalho que aparece mais é o administrador (9364 pessoas)
#                                         o estado civil que mais aparece é casado (22424 pessoas)

           job  marital          education  ... day_of_week     poutcome      y
count    36773    37000              35505  ...       37069        37069  37069
unique      11        3                  7  ...           5            3      2
top     admin.  married  university.degree  ...         thu  nonexistent     no
freq      9364    22424              10967  ...        7735        31989  32893

[4 rows x 11 columns]

In [ ]:
sns.countplot(data=df, x='y', hue='marital')